// Реализовать класс, описывающий окружность. В классе должны быть следующие компоненты:

// поле, хранящее радиус окружности;
// get-свойство, возвращающее радиус окружности;
// set-свойство, устанавливающее радиус окружности;
// get-свойство, возвращающее диаметр окружности;
// метод, вычисляющий площадь окружности;
// метод, вычисляющий длину окружности.
// Продемонстрировать работу свойств и методов. 

class circle {
    constructor(value) {
        this.value = value;
    }

    get value() {
        return this._value;
    }

    set value(radius) {

    }

    
    get radius() {
        return this._value;
    }

}